app/views/cart/_cart.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---

  <% @user.user_items.each do |user_item| %>