app/views/cart/index.html.erb


  <% @user.user_items.each do |user_item| %>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]

      <td><%= Item.find(user_item.item_id).name %></td>
      <td>$<%= Item.find(user_item.item_id).price %></td>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]