app/controllers/items_controller.rb

  def index
    @items = Item.all
    @user = User.find(session[:user_id])
---
SELECT "items".* FROM "items"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "quantity" = ? WHERE "items"."id" = ?  [["quantity", nil], ["id", 1]]