app/controllers/items_controller.rb

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_purchase
    @purchase = Purchase.find(params[:id])