app/models/user.rb

  def cart_price
    # Adds up the total price of the users item
    self.user_items.sum do |item|
      Item.find(user_item.item_id).price * user_item.quantity
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]